/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//BASE ARRAY TRANSLATION FOR ALL HTML////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationBase = {
    currentLang: "РУС",
    firstLang: "Английский",
    secondLang: "Испанский",
    navBar1: "Концепт-арт",
    navBar2: "Интерфейсы",
    navBar3: "3Д",
    navBar4: "Игры",
    navBar5: "Обо мне",
    copyRight1: "Все права защищены",
    copyRight2: "Авторские права © Анастасия Игнатенко Шахова 2024 - 2025",
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//INDEX.HTML ARRAY TRANSLATION///////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatableIndexHTML = {
    category1: "Дизайн персонажей",
    category2: "Дизайн среды",
    projName1: "Арида Ульмо",
    projName2: "Приключения Авы",
    projName3: "Дригори'с Куарере",
    projName4: "Солум Флос Цибус",
    projName5: "Месть мистера Эразера",
    projName6: "SCR",
    projName7: "Скрытые места",
    projName8: "The Way Beyond",
    projName9: "Seek & Sail",
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//UI.HTML ARRAY TRANSLATION//////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatableUiHTML = {
    category1: "Ты <span style='font-family: Quicksand, sans-serif; font-weight: bold'>осмелишься</span>?",
    projName1: "Space Combat Rush 3D",
    projName2: "The Way Beyond",
    projName3: "Seek & Sail",
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//3D.HTML ARRAY TRANSLATION//////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatable3dHTML = {
    category1: "Персонажи",
    category2: "Среда и пропсы",
    category3: "Риг и анимация",
    projName1: "Атака зомби",
    projName2: "Фогги",
    projName3: "The Inner Doors",
    projName4: "The Way Beyond",
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//GAMES.HTML ARRAY TRANSLATION///////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatableGamesHTML = {
    category1: "<span style='font-family: Quicksand, sans-serif; font-weight: bold'>Осмелитесь</span> сыграть?",
    projName1: "Mr Erazer's Revenge (кликай!)",
    projName2: "SCR (кликай!)",
    projName3: "SPADE (кликай!)",
    projName4: "The Inner Doors (кликай!)",
    projName5: "SCR3D (кликай!)",
    projName6: "Seek & Sail (кликай!)",
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//ABOUT.HTML ARRAY TRANSLATION///////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatableAboutHTML = {
    biography: "Анастасия (более известная как Тасия или Тас) — художник по видеоиграм, которая изначально мечтала стать военным нейрохирургом, но в последний момент изменила направление и поступила на Дизайн и Разработку Видеоигр — выбор, который запустил её творческую карьеру. <br><br>" +
        "<span style=\"display: block; margin-top: 0.5em\"> Её жизнь была полна приключений и испытаний: от выживания после частичной потери памяти после падения с лошади до недельного пребывания в одиночку в лесах России в 12 лет. Не волнуйтесь, она всё ещё жива... как-то.</span><br>"+
        "<span style=\"display: block; margin-top: 0.5em\"> Она немного трудоголик, но всё же находит время для чтения, изучения новых языков (сейчас знает 5!) и просмотра мультфильмов.</span><br>"+
        "<span style=\"display: block; margin-top: 0.5em\"> Электронная почта: <a href='mailto:tasiatasart@gmail.com' style=\"color: #d66a42;\">tasiatasart@gmail.com</a> или отправьте мне сообщение ниже!</span>",
    knowledge: "Навыки",
    knowledge1: "<span style='font-weight: bold'>Программирование</span> [HTML, CSS, JavaScript, Python & Unity (c#)]",
    knowledge2: "<span style='font-weight: bold'>3D моделирование, риггинг и анимация</span>  [Blender & 3ds Max]",
    knowledge3: "<span style='font-weight: bold'>Концепт-арт и иллюстрация</span>  [Clip Studio Paint & Photoshop]",
    knowledge4: "<span style='font-weight: bold'>2D риггинг и анимация</span>  [Clip Studio Paint & After Effects]",
    knowledge5: "<span style='font-weight: bold'>Видеомонтаж</span>  [After Effects & Blender]",
    recognitions: "Признания",
    recognition1: "2-е место – Классное соревнование по многопользовательским играм (SCR3D, 2024)",
    recognition2: "3-е место и Почётная грамота за искусство – Game Scholars (The Inner Doors, 2023)",
    recognition3: "Показано на Guerrilla Event (The Inner Doors, 2023)",
    recognition4: "Получила стипендию за выдающиеся академические достижения 2023–24",
    errorMessage: "Не удалось отправить форму. Отсутствует необходимая информация. Пожалуйста, проверьте данные ниже.",
    name: "Имя",
    surname: "Фамилия",
    email: "Эл. почта",
    enterValidEmail: " Пожалуйста, введите действительный адрес электронной почты",
    subject: "Тема",
    message: "Сообщение",
    required: "Необходимый",
    submit: "Отправить"
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//FORMSENT.HTML ARRAY TRANSLATION////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const rusTranslationUpdatableFormSentHTML = {
    sent: "Сообщение отправлено!",
    thankYou: "Большое спасибо за ваше сообщение. Я отвечу вам, как только смогу!",
    return: "Вернуться"
}