/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//FIRST MESSAGE ARRAY (NON CLICKABLE)////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const firstTextArrayConceptArt_ru = [
    [
        "Не бойся, я <span style='font-family: Quicksand, sans-serif; font-weight: bold; font-style: italic'>великодушно</span> сохраню это место для тебя...",
        "Только не делай из этого привычку.",
    ],
    [
        "Выражаю <span style='font-family: Quicksand, sans-serif; font-weight: bold; font-style: italic'>глубочайшие</span> соболезнования в связи с твоей скукой...",
        "А теперь, уходи.",

    ],
    "Давайте уделим минутку, чтобы вы могли рассказать мне о своих нерешенных травмирующих проблемах?",
    [
        "Ах, смелая душа испытывает воды!",
        "Награда, увы, лишь моё презрение.",
    ],
    "Если пришёл рассказывать о своих несчастьях… будьте любезны, уйдите."
];

const firstTextArrayDaring_ru = [
    "Вижу, ты <span style='font-family: Quicksand, sans-serif; font-weight: bold'>осмелился</span>.",
    "Браво! Мы только что обнаружили кинематографическую жертву часа.",
    "Ну разве ты не смелый…",
    "Твоя жизнь для тебя чтоле <span style='font-family: Quicksand, sans-serif; font-weight: bold; font-style: italic'>ничего</span> не значит?!",
    "Существа всех мастей, соберитесь, чтобы увидеть вершину глупости!"
];

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//RETURN MESSAGE ARRAY (NON CLICKABLE)///////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const returnTextArrayConceptArt_ru = [
    "Снова здесь?"
];

const returnTextArrayDaring_ru = [
    "Ты уже доказал, что смел…"
];

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//CLICKABLE MESSAGE ARRAY////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const normalTextArray_ru= [
    "Когда будешь готов уйти, можешь идти, дорогой.",
    "Мне нужно подписать документы. Уходи."
];

const loreTextArray_ru = [
    "Я очень надеюсь, что мои покойные родители не станут свидетелями этого нападения.",
    "Ты, мойя дорогойя заноза, можешь составить конкуренцию даже самым дерзким диверсантам империи моей компании."
];

const annoyedTextArray_ru = [
    [//array annoyance level 1
        "Да, да, я вижу что ты всё ещё здесь",
        "Привет."
    ],
    [//array annoyance level 2
        "Господи... твоя настойчивость поражает, если не сказать раздражает.",
        "Дааа"
    ],
    [//array annoyance level 3
        "Дай мне спокойно попить чай.",
        "Фу"
    ]
];

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//BORED MESSAGE ARRAY////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
const boredTextArray_ru = [
    "Эй! Ты ещё здесь?"
];

//Fine. Click away. I don't even care anymore.
//I've stopped talking to you. Go away.
//Alright, this is harassment.
//Ever heard of personal space?
//Oh good, it's you again. Joy.